# DefaultOpenFromCloudCallback Class

---
A default callback that may be used to control Revit's behavior when opening a model.
SystemObject Autodesk.Revit.DBDefaultOpenFromCloudCallback
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class DefaultOpenFromCloudCallback : IOpenFromCloudCallback,
    	IDisposable

    Public Class DefaultOpenFromCloudCallback
    	Implements IOpenFromCloudCallback, IDisposable

    public ref class DefaultOpenFromCloudCallback : IOpenFromCloudCallback,
    	IDisposable

    type DefaultOpenFromCloudCallback =
        class
            interface IOpenFromCloudCallback
            interface IDisposable
        end
The DefaultOpenFromCloudCallback type exposes the following members.
| Name| Description
---|---|---
| DefaultOpenFromCloudCallback|  Create a default open callback. Open latest by default for all scenarios.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the DefaultOpenFromCloudCallback
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| OnOpenConflict|  A method called when the conflict is happen during the model opening.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace